Day1/projects/address_book/app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all.order("name ASC")
---
SELECT "contacts".* FROM "contacts"  ORDER BY name ASC

  def create
    if(params[:contact][:name].length > 0 && params[:contact][:address].length > 0)
      contact = Contact.new(
        :name => params[:contact][:name],
        :address => params[:contact][:address],
        :phone => params[:contact][:phone],
        :email => params[:contact][:email])
      contact.save
---
INSERT INTO "contacts" ("name", "address", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @contact = Contact.find(params[:id_contact])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", 12]]

  def favourite
    @contact = Contact.find(params[:id_contact])
    @contact.favourite = true;
    @contact.save
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "contacts" SET "favourite" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["favourite", "t"], ["updated_at", "2016-02-22 19:31:20.459463"], ["id", 11]]

  def search

    @contacts = Contact.search(params[:contact][:letter])
---
SELECT "contacts".* FROM "contacts" WHERE (name like "#{letter}"%)